alexgubanow/ExtensionMashine/stm32f103Control/gpio.h
/**
  ******************************************************************************
  * File Name          : gpio.h
  * Description        : This file contains all the functions prototypes for 
  *                      the gpio  
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2018 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __gpio_H
#define __gpio_H
#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
#include "main.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

void MX_GPIO_Init(void);

#define motorFAULT_Pin GPIO_PIN_0
#define motorFAULT_GPIO_Port GPIOA
#define motorFAULT_EXTI_IRQn EXTI0_IRQn
#define motorEN_Pin GPIO_PIN_1
#define motorEN_GPIO_Port GPIOA
#define motorDIR_Pin GPIO_PIN_2
#define motorDIR_GPIO_Port GPIOA
#define motorSLEEP_Pin GPIO_PIN_3
#define motorSLEEP_GPIO_Port GPIOA
#define sp1NSS_M2_Pin GPIO_PIN_4
#define sp1NSS_M2_GPIO_Port GPIOA
#define sp1CLK_M1_Pin GPIO_PIN_5
#define sp1CLK_M1_GPIO_Port GPIOA
#define sp1MISO_motorReset_Pin GPIO_PIN_6
#define sp1MISO_motorReset_GPIO_Port GPIOA
#define sp1MOSI_M0_Pin GPIO_PIN_7
#define sp1MOSI_M0_GPIO_Port GPIOA
#define endStop1_Pin GPIO_PIN_10
#define endStop1_GPIO_Port GPIOB
#define endStop1_EXTI_IRQn EXTI15_10_IRQn
#define endStop2_Pin GPIO_PIN_11
#define endStop2_GPIO_Port GPIOB
#define endStop2_EXTI_IRQn EXTI15_10_IRQn
#define tim1ch1_STEP_Pin GPIO_PIN_8
#define tim1ch1_STEP_GPIO_Port GPIOA
#define hx711CLK_Pin GPIO_PIN_6
#define hx711CLK_GPIO_Port GPIOB
#define hx711DAT_Pin GPIO_PIN_7
#define hx711DAT_GPIO_Port GPIOB
/* USER CODE BEGIN Prototypes */

/* USER CODE END Prototypes */

#ifdef __cplusplus
}
#endif
#endif /*__ pinoutConfig_H */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
